Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-Devashish-Soni-23]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=52ecdfdc-28c4-4a6c-bbac-29a2667434e8]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-Devashish-Soni-23]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_3f403fdd-df6f-4bad-8cf6-003c03c8bf62.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-Devashish-Soni-23:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function-Devashish-Soni-23]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-function-Devashish-Soni-23]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Devashish-Soni-23" -> (known after apply)
      ~ code_sha256                    = "ThpXeTZobED3ATPn7m4pXZIgyOEqiZM/qo5OX/My6zE=" -> (known after apply)
      ~ function_name                  = "hello-kitty-function-Devashish-Soni-23" -> "hello-kitty-function-devashish-soni-23" # forces replacement
      ~ id                             = "hello-kitty-function-Devashish-Soni-23" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Devashish-Soni-23/invocations" -> (known after apply)
      ~ last_modified                  = "2024-09-28T09:51:27.583+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Devashish-Soni-23:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Devashish-Soni-23:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::222634395437:role/hello-kitty-role-Devashish-Soni-23" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 2168 -> (known after apply)
        tags                           = {
            "appstack"  = "kitty-app"
            "component" = "hello-kitty"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "Devashish-Soni-23" -> "devashish-soni-23"
            }
        }

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hello-kitty-function-Devashish-Soni-23" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
      ~ function_arn       = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Devashish-Soni-23" -> (known after apply)
      ~ function_name      = "hello-kitty-function-Devashish-Soni-23" -> "hello-kitty-function-devashish-soni-23" # forces replacement
      ~ function_url       = "https://ya22ji63b6inwzffa4od2gonka0hnyfm.lambda-url.us-west-2.on.aws/" -> (known after apply)
      ~ id                 = "hello-kitty-function-Devashish-Soni-23" -> (known after apply)
      ~ url_id             = "ya22ji63b6inwzffa4od2gonka0hnyfm" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.appcd_3f403fdd-df6f-4bad-8cf6-003c03c8bf62.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-role-Devashish-Soni-23:Writer" -> (known after apply)
        name        = "Writer"
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Devashish-Soni-23",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Devashish-Soni-23:*",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role        = "hello-kitty-role-Devashish-Soni-23" -> "hello-kitty-role-devashish-soni-23" # forces replacement
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] will be created
  + resource "aws_kms_alias" "a" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-devashish-soni-23"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "52ecdfdc-28c4-4a6c-bbac-29a2667434e8"
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "devashish-soni-23"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "appstack"  = "kitty-app"
          + "component" = "hello-kitty"
        }
      + tags_all                    = {
          + "appstack"  = "kitty-app"
          + "component" = "hello-kitty"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "52ecdfdc-28c4-4a6c-bbac-29a2667434e8"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Devashish-Soni-23" -> (known after apply)
      ~ id                = "/aws/lambda/hello-kitty-function-Devashish-Soni-23" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/hello-kitty-function-Devashish-Soni-23" -> "/aws/lambda/hello-kitty-function-devashish-soni-23" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "appstack"  = "kitty-app"
            "component" = "hello-kitty"
        }
        # (4 unchanged attributes hidden)
    }

  # module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::222634395437:role/hello-kitty-role-Devashish-Soni-23" -> (known after apply)
      ~ create_date           = "2024-09-28T09:51:17Z" -> (known after apply)
      ~ id                    = "hello-kitty-role-Devashish-Soni-23" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "hello-kitty-role-Devashish-Soni-23" -> "hello-kitty-role-devashish-soni-23" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "appstack"  = "kitty-app"
            "component" = "hello-kitty"
        }
      ~ unique_id             = "AROATHVQLI4WXMOG443WI" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "Writer" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Devashish-Soni-23",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Devashish-Soni-23:*",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.appcd_c1b29230-f236-46fc-b4b0-132b715bd5c8.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-role-devashish-soni-23"
    }

Plan: 11 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_devashish_soni_23_arn  = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Devashish-Soni-23" -> (known after apply)
  ~ aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_devashish_soni_23_name = "/aws/lambda/hello-kitty-function-Devashish-Soni-23" -> "/aws/lambda/hello-kitty-function-devashish-soni-23"
  ~ aws_iam_role_hello_kitty_role_devashish_soni_23_arn                             = "arn:aws:iam::222634395437:role/hello-kitty-role-Devashish-Soni-23" -> (known after apply)
  ~ aws_iam_role_hello_kitty_role_devashish_soni_23_name                            = "hello-kitty-role-Devashish-Soni-23" -> "hello-kitty-role-devashish-soni-23"
  ~ aws_lambda_hello_kitty_function_devashish_soni_23_function_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Devashish-Soni-23" -> (known after apply)
  ~ aws_lambda_hello_kitty_function_devashish_soni_23_function_name                 = "hello-kitty-function-Devashish-Soni-23" -> "hello-kitty-function-devashish-soni-23"
  ~ aws_lambda_hello_kitty_function_devashish_soni_23_function_url                  = "https://ya22ji63b6inwzffa4od2gonka0hnyfm.lambda-url.us-west-2.on.aws/" -> (known after apply)
  ~ aws_lambda_hello_kitty_function_devashish_soni_23_invoke_arn                    = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Devashish-Soni-23/invocations" -> (known after apply)
  + aws_s3_devashish_soni_23_arn                                                    = (known after apply)
  + aws_s3_devashish_soni_23_bucket_name                                            = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```